#==============================================================================
# ■ Game_Quest
#------------------------------------------------------------------------------
# 　クエストの内部データ
#==============================================================================

class Game_Quest
  #--------------------------------------------------------------------------
  # ● オブジェクト初期化
  #   Quest { key => 0:Active 5:Wait 999:Inactive}
  #--------------------------------------------------------------------------
  def initialize
    @q_hash = {}
  end
  #--------------------------------------------------------------------------
  # ● リフレッシュクエストデータ
  #   クエストDBが更新された場合に新規追加分をActiveにする
  #--------------------------------------------------------------------------
  def refresh_quest_data
    @q_hash ||= {}          # 定義がなければ作成
    for quest in $data_quests
      next if quest == nil  # 空はスキップ
      key = quest.id        # KEYはIDとする
      if @q_hash[key] == nil# 定義が入っていない場合
        @q_hash[key] = 0    # Activeにリセット
      end
    end
  end
  #--------------------------------------------------------------------------
  # ● クエストアクティブ情報DBを返す
  #--------------------------------------------------------------------------
  def data
    return @q_hash
  end
  #--------------------------------------------------------------------------
  # ● クエストのディアクティベイト
  #--------------------------------------------------------------------------
  def deactivate(id)
    if $data_quests[id].repeat == "TRUE"
      @q_hash[id] = $data_quests[id].min  # インターバルをセット
      DEBUG::write(c_m,"QuestID:#{id} インターバルセット:#{$data_quests[id].min}分")
    else
      @q_hash[id] = 999 # Inactive
      DEBUG::write(c_m,"QuestID:#{id} => Inactive")
    end
  end
  #--------------------------------------------------------------------------
  # ● クエストの更新　1分毎
  #--------------------------------------------------------------------------
  def check_quest_update_for_1_min
    for q_id in @q_hash.keys
      if @q_hash[q_id] > 0 and @q_hash[q_id] != 999
        @q_hash[q_id] -= 1
        DEBUG::write(c_m,"QuestID:#{q_id} 残り:#{@q_hash[q_id]}分")
      end
    end
  end
end
