#==============================================================================
# ■ Window_PartyCommand
#------------------------------------------------------------------------------
# 　バトル画面で、戦うか逃げるかを選択するウィンドウです。
#==============================================================================

class Window_PartyCommand < WindowCommand
  #--------------------------------------------------------------------------
  # ● オブジェクト初期化
  #--------------------------------------------------------------------------
  def initialize
    s1 = "  たたかう"
    s2 = "  にげだす"
    s3 = "  たいれつへんこう"
    super(220, [s1, s2, s3], 1, 3)
    draw_item(0, true)
    draw_item(1, true)
    draw_item(2, true)
#~     self.windowskin = Cache.system("Window_Black")
    self.active = false
    self.visible = false
    self.x = (512-220)/2
    self.y = 340
    @adjust_x = WLW
  end
end
