#==============================================================================
# ■ Window_PartyCommand
#------------------------------------------------------------------------------
# 　バトル画面で、戦うか逃げるかを選択するウィンドウです。
#==============================================================================

class Window_VerifyCommand < WindowCommand
  #--------------------------------------------------------------------------
  # ● オブジェクト初期化
  #--------------------------------------------------------------------------
  def initialize
    s1 = "  せんとうかいし"
    s2 = "  もどる"
    super(180, [s1, s2], 1, 2)
    self.active = false
    self.visible = false
    self.adjust_x = WLW
    self.back_opacity = 255
    self.x = (512-180)/2
    self.y = 160
  end
end
