#==============================================================================
# ■ SceneAllDead
#------------------------------------------------------------------------------
# 20名の冒険者が全員死亡時の処理を行うクラスです。
#==============================================================================

class SceneAllDead < SceneBase
  #--------------------------------------------------------------------------
  # ● 初期化処理
  #--------------------------------------------------------------------------
  def initialize
    @message_window = Window_Message.new
  end
  #--------------------------------------------------------------------------
  # ● 開始処理
  #--------------------------------------------------------------------------
  def start
    super
    RPG::BGM.stop
    RPG::BGS.stop
    $music.play("ぜんめつ")
#~     Graphics.transition(20)
#~     Graphics.freeze
    text1 = "GAME OVER:"
    text2 = "20めい すべてのぼうけんしゃが うしなわれた。"
    text3 = "セーブデータが しょうきょされます。"
    $game_message.texts.push(text1)
    $game_message.texts.push(text2)
    $game_message.texts.push(text3)
    Debug.write(c_m,"=======================================")
    Debug.write(c_m,"=======================================")
    Debug.write(c_m,"=======================================")
    Debug.write(c_m,"=======================================")
    case Debug::remove_save_data
    when 1
      Debug.write(c_m,"=======GAMEOVER SaveDATA削除完了=======")
    when 0
      Debug.write(c_m,"=======GAMEOVER SaveDATA削除失敗=======")
    end
  end
  #--------------------------------------------------------------------------
  # ● 終了処理
  #--------------------------------------------------------------------------
  def terminate
    super
    @message_window.dispose
  end
  #--------------------------------------------------------------------------
  # ● フレーム更新
  #--------------------------------------------------------------------------
  def update
    super
    @message_window.update
    if Input.trigger?(Input::C)
      Graphics.fadeout(20)
      exit
    end
  end
  #--------------------------------------------------------------------------
  # ● トランジション実行
  #--------------------------------------------------------------------------
  def perform_transition
    Graphics.transition(20)
  end
end
