#==============================================================================
# ■ Window_SaveFile
#------------------------------------------------------------------------------
# セーブ画面およびロード画面で表示する、セーブファイルのウィンドウです。
#==============================================================================

class Window_TITLE < WindowBase
  #--------------------------------------------------------------------------
  # ● オブジェクト初期化
  #     file_index : セーブファイルのインデックス (0～3)
  #     filename   : ファイル名
  #--------------------------------------------------------------------------
  def initialize
    super(4, 4, 512-8, 448-8)
    self.opacity = 255
    refresh
  end
  #--------------------------------------------------------------------------
  # ● エピソード名の表示
  #--------------------------------------------------------------------------
  def show_episode
    self.contents.draw_text(0, WLH*20, self.width-32, WLH,"THE FIRST EPISODE", 1)
    self.contents.draw_text(0, WLH*21, self.width-32, WLH,"CASTLE OF THE MONKEY KING", 1)
  end
  #--------------------------------------------------------------------------
  # ● ロゴの表示
  #--------------------------------------------------------------------------
  def show_logo
    self.contents.draw_text(0, WLH*24, self.width-32, WLH,"@KuwanSoft", 1)
  end
  #--------------------------------------------------------------------------
  # ● リフレッシュ
  #--------------------------------------------------------------------------
  def refresh(page = 1)
    self.contents.clear
    case page
    when 1
      show_sprite
      show_episode
      show_logo
    when 2
      show_sprite
      show_logo
    end
  end
  #--------------------------------------------------------------------------
  # ● タイトルスプライトの表示
  #--------------------------------------------------------------------------
  def show_sprite
    @face = Sprite.new
    @face.bitmap = Cache.system("title_graphic")
    @face.x = 512/2
    @face.y = WLH*14
    @face.z = self.z + 1
    @face.ox = @face.width / 2
    @face.oy = @face.height / 2
  end
  #--------------------------------------------------------------------------
  # ● 開放
  #--------------------------------------------------------------------------
  def dispose
    super
    @face.bitmap.dispose
    @face.dispose
  end
end
