#==============================================================================
# ■ Window_ShopHelp
#------------------------------------------------------------------------------
# ショップ画面で、購入できる商品の一覧を表示するウィンドウです。
#==============================================================================

class Window_ShopHelp < WindowBase
  #--------------------------------------------------------------------------
  # ● オブジェクト初期化
  #     x : ウィンドウの X 座標
  #     y : ウィンドウの Y 座標
  #--------------------------------------------------------------------------
  def initialize
    super( 4, 448-(WLH*2+32+4), WLW*12-4, 32+32)
    self.visible = false
    refresh
  end
  #--------------------------------------------------------------------------
  # ● リフレッシュ
  #--------------------------------------------------------------------------
  def refresh(kind="買う")
    case kind
    when "買う"
      text1 = "[A]かう"
      text2 = "[B]もどる"
    when "鑑定"
      text1 = "[A]かんてい"
      text2 = "[B]もどる"
    when "売る"
      text1 = "[A]うる"
      text2 = "[B]もどる"
    when "解呪"
      text1 = "[A]のろいをとく"
      text2 = "[B]もどる"
    end
    self.contents.clear
    self.contents.draw_text(0, 0, self.width-32, WLH, text1)
    self.contents.draw_text(0, WLH, self.width-32, WLH, text2)
  end
end
