#==============================================================================
# ■ Window_HerbList
#------------------------------------------------------------------------------
# 　ハーブ選択画面
#==============================================================================

class Window_HerbList < WindowSelectable
  #--------------------------------------------------------------------------
  # ● オブジェクト初期化
  #     x : ウィンドウの X 座標
  #     y : ウィンドウの Y 座標
  #--------------------------------------------------------------------------
  def initialize
    super( 0, WLH*14, WLW*15+32, 32*6+32)
    self.visible = false
    self.active = false
    self.opacity = 255
    self.z += 5
    @selected = []
    @row_height = 32
  end
  #--------------------------------------------------------------------------
  # ● 該当Tierの呪文リストの表示
  #--------------------------------------------------------------------------
  def refresh(actor)
    @actor = actor
    @actor.make_herbbag
    @data = @actor.get_herbbag
    @item_max = @data.size
    create_contents
    for i in 0...@item_max
      draw_item(i)
    end
  end
  #--------------------------------------------------------------------------
  # ● 選択内容の取得
  #--------------------------------------------------------------------------
  def selection
    @selected.push(self.index)
    return @data[self.index]
  end
  #--------------------------------------------------------------------------
  # ● 内容のクリア
  #--------------------------------------------------------------------------
  def clear
    self.contents.clear
  end
  #--------------------------------------------------------------------------
  # ● 項目の描画
  #     index : 項目番号
  #--------------------------------------------------------------------------
  def draw_item(index)
    kind = @data[index][0][0]
    id = @data[index][0][1]
    item_data = Misc.item(kind, id)
    rect = item_rect(index)
    self.contents.clear_rect(rect)
    draw_item_name(rect.x, rect.y, item_data)
  end
end
