# #==============================================================================
# # ■ Window_SubWindow_Back
# #------------------------------------------------------------------------------
# # 　迷宮画面の上部に位置する蝋燭の表示を行うクラスです。
# #   迷宮画面の上に位置する現在地の表示を行うクラスです。
# #==============================================================================
# class Window_SubWindow_Back < Window_Base
#   #--------------------------------------------------------------------------
#   # ● オブジェクト初期化
#   #--------------------------------------------------------------------------
#   def initialize
#     super((512-320)/2, 4, 320, 32+32)
#     self.windowskin = Cache.system("Window_Black")
#     self.visible = true
#     self.back_opacity = 128
#     self.contents_opacity = 255
#   end
# end
