#==============================================================================
# ■ Window_SummonStatus
#------------------------------------------------------------------------------
# 召喚モンスターのステータス表示を行うクラスです。
#==============================================================================
class Window_SummonStatus < Window_Base
  def initialize
    if $game_mercenary.all_dead?
      super( (512-320)/2, 188+80, 320, WLH*1+32)
    elsif $game_summon.all_dead?
      super( (512-320)/2, 188+80, 320, WLH*1+32)
    else
      super( (512-320)/2, 188+80, 320, WLH*2+32)
    end
    self.visible = false
    self.z = 101
    refresh
  end
  #--------------------------------------------------------------------------
  # ● 表示オン
  #--------------------------------------------------------------------------
  def turn_on
    self.visible = true
  end
  #--------------------------------------------------------------------------
  # ● 表示オフ
  #--------------------------------------------------------------------------
  def turn_off
    self.visible = false
  end
  #--------------------------------------------------------------------------
  # ● 選択結果の取得
  #--------------------------------------------------------------------------
  def result
    return @result
  end
  #--------------------------------------------------------------------------
  # ● フレーム更新 (シーンマップの時のみKEY受付)
  #--------------------------------------------------------------------------
  def update
    super
    if $game_temp.need_ps_refresh
      refresh
      $game_temp.need_ps_refresh = false
    end
  end
  #--------------------------------------------------------------------------
  # ● リフレッシュ
  #--------------------------------------------------------------------------
  def refresh
    self.contents.clear
#~     return if $game_summon.existing_members.size == 0
#~     spirit = $game_summon.existing_members[0]
    draw_summon_status
  end
end
