#==============================================================================
# ■ Window_ContinueInfo
#------------------------------------------------------------------------------
# セーブ画面およびロード画面で表示する、パーティ数を表示
#==============================================================================

class Window_ContinueInfo < Window_Base
  #--------------------------------------------------------------------------
  # ● オブジェクト初期化
  #--------------------------------------------------------------------------
  def initialize
    super((512-380)/2, 90, 380, 24*2+32)
    self.visible = false
    change_font_to_v
  end
  #--------------------------------------------------------------------------
  # ● リフレッシュ
  #--------------------------------------------------------------------------
  def refresh(number)
    self.visible = true
    self.contents.clear
    text1 = "げんざい、#{number}パーティが"
    text3 = "ぼうけんちゅうです。"
    self.contents.draw_text(STA, 24*0, self.width-32, 24, text1, 0)
    self.contents.draw_text(STA, 24*1, self.width-32, 24, text3, 2)
  end
end
