class Window_Top < WindowBase
  #--------------------------------------------------------------------------
  # ● オブジェクト初期化
  #--------------------------------------------------------------------------
  def initialize
    super(0, -10, 512, WLH+32)
    self.opacity = 0
    set_text
  end
  #--------------------------------------------------------------------------
  # ● テキスト設定
  #--------------------------------------------------------------------------
  def set_text
    text = "Museum of Monsters"
    self.contents.draw_text(0, 0, self.width-32, WLH, text, 1)
  end
end
