#==============================================================================
# ■ SceneTreasure
#------------------------------------------------------------------------------
# メニュー画面の処理を行うクラスです。
#==============================================================================

class SceneTomb < SceneBase
  #--------------------------------------------------------------------------
  # ● オブジェクト初期化
  #     menu_index : コマンドのカーソル初期位置
  #--------------------------------------------------------------------------
  def initialize
    $music.play("ぼち")
    @attention_window = Window_Attention4.new   # attention表示用
    @tomb = Window_TOMB.new
    create_window                               # 店の名前の作成
  end
  #--------------------------------------------------------------------------
  # ● 終了処理
  #--------------------------------------------------------------------------
  def terminate
    super
    @attention_window.dispose
    @tomb.dispose
    @locname.dispose
  end
  #--------------------------------------------------------------------------
  # ● 更新
  #--------------------------------------------------------------------------
  def update
    super
    @tomb.update
    if @tomb.active
      update_tomb
    end
  end
  #--------------------------------------------------------------------------
  # ● 店の名前の作成
  #--------------------------------------------------------------------------
  def create_window
    @locname = Window_LOCNAME.new
    @locname.set_text("きょうどうぼち")
    @locname.visible = true
  end
  #--------------------------------------------------------------------------
  # ● アテンション表示が終わるまでウェイト
  #--------------------------------------------------------------------------
  def wait_for_attention
    while @attention_window.visible
      Graphics.update                 # ゲーム画面を更新
      Input.update                    # 入力情報を更新
      @attention_window.update        # ポップアップウィンドウを更新
    end
  end
  #--------------------------------------------------------------------------
  # ● 開始処理
  #--------------------------------------------------------------------------
  def start
    super
    @tomb.refresh
    @tomb.active = true
    @tomb.visible = true
  end
  #--------------------------------------------------------------------------
  # ● 更新
  #--------------------------------------------------------------------------
  def update_tomb
    if not @tomb.check
      text1 = "ぼひょうにきざまれた"
      text2 = "かずある ぼうけんしゃたちの"
      text3 = "なのなかに"
      text4 = "きみたちの しるものは なかった。"
      @attention_window.set_text(text1, text2, text3, text4)
      wait_for_attention
      $scene = Scene_EdgeOfTown.new
    elsif Input.trigger?(Input::B)
      $scene = Scene_EdgeOfTown.new
    end
  end
end
